app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = $1 ORDER BY title LIMIT 1  [["id", "1"]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "price", "product_id", "quantity", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2014-05-15 13:07:26.823431' WHERE "line_items"."id" = 1
---
  def create
    @cart      = current_cart
    product    = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save