app/controllers/orders_controller.rb

  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        Notifier.order_received(@order).deliver
---
INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 1