app/controllers/store_controller.rb

SELECT "products".* FROM "products" WHERE "products"."locale" = 'en' AND "products"."active" = 't' ORDER BY title
---
  def index
    if params[:set_locale]
      redirect_to store_path(:locale => params[:set_locale])
    else
      @cart     = current_cart
    end

    # Playtime: filter products by default locale if provided
    if params[:locale]
      @products = Product.where(:locale => params[:locale], :active => true)